testCases/otherCases/01_solid_body_addition/D_create_nonConvexBody/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  dev                                        |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// application     pimpleHFDIBFoam;
application     HFDIBDEMFoam;

startFrom       latestTime;

startTime       0;

stopAt          endTime;
stopAt          writeNow;

endTime         1;

deltaT          0.001;

writeControl    adjustableRunTime;

writeInterval   0.01;

purgeWrite      0;

writeFormat     ascii;

writePrecision  8;

writeCompression uncompressed;

timeFormat      general;

timePrecision   8;

maxCo           1.0;

maxDeltaT       0.001;

adjustTimeStep  no;

runTimeModifiable yes;

writeCompression off;

// ************************************************************************* //
