testCases/otherCases/01_solid_body_addition/D_create_nonConvexBody/0.org/lambda
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  3.0.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      lambda;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    z1
    {
        type            zeroGradient;
    }
    z0
    {
         type            zeroGradient;
    }
    x1
    {
        type            zeroGradient;
    }
    x0
    {
        type            zeroGradient;
    }    
    y1
    {
        type            zeroGradient;
    }
    y0
    {
        type            zeroGradient;
    }

}


// ************************************************************************* //
